library(readxl)

# Prepare data

#2009
d <- read_excel("data/2009.xls", sheet = 2, skip = 4)
d <- d[-1,]
d2009 <- d[which(d$`Статьи УК РФ` == "228-233"),]
d2009$amnesty <- sum(d2009[,23:26])
d2009 <- d2009[,c("ВСЕГО ОСУЖДЕНО","Лишение свободы: всего","Условное осуждение к лишению свободы","Штраф", "Определено лечение: всего", "amnesty")]
d2009$year <- 2009
d2009$articles <- "228-233"

#2010
d <- read_excel("data/2010.xls", sheet = 2, skip = 4)
d <- d[-1,]
d2010 <- d[which(d$`Статьи УК РФ` == "228-233"),]
d2010$amnesty <- sum(as.numeric(d2010[,23:26]))
d2010 <- d2010[,c("ВСЕГО ОСУЖДЕНО","Лишение свободы: всего","Условное осуждение к лишению свободы","Штраф", "Определено лечение: всего", "amnesty")]
d2010$year <- 2010
d2010$articles <- "228-233"
#2011
d <- read_excel("data/2011.xls", sheet = 2, skip = 4)
d <- d[-1,]
d2011 <- d[which(d$`Статьи УК РФ` == "228-234"),]
d2011$amnesty <- sum(as.numeric(d2011[,23:26]))
d2011 <- d2011[,c("ВСЕГО ОСУЖДЕНО","Лишение свободы: всего","Условное осуждение к лишению свободы","Штраф", "Определено лечение: всего", "amnesty")]
d2011$year <- 2011
d2011$articles <- "228-234"
#2012
d <- read_excel("data/2012.xls", sheet = 2, skip = 4)
d <- d[-1,]
d2012 <- d[which(d$`Статьи УК РФ` == "228-234"),]
d2012$amnesty <- sum(as.numeric(d2012[,23:26]))
d2012 <- d2012[,c("ВСЕГО ОСУЖДЕНО","Лишение свободы: всего","Условное осуждение к лишению свободы","Штраф", "Определено лечение: всего", "amnesty")]
d2012$year <- 2012
d2012$articles <- "228-234"
#2013
d <- read_excel("data/2013.xls", sheet = 2, skip = 4)
d <- d[-1,]
d2013 <- d[which(d$`Статьи УК РФ` == "228-234"),]
d2013$amnesty <- sum(as.numeric(d2013[,28:31]))
d2013 <- d2013[,c("ВСЕГО ОСУЖДЕНО","Лишение свободы: всего","Условное осуждение к лишению свободы","Штраф", "Определено лечение: всего", "amnesty")]
d2013$year <- 2013
d2013$articles <- "228-234"
#2014
d <- read_excel("data/2014.xls", sheet = 2, skip = 4)
d <- d[-1,]
d2014 <- d[which(d$`Статьи УК РФ` == "228-234"),]
d2014$amnesty <- sum(as.numeric(d2014[,28:31]))
d2014 <- d2014[,c("ВСЕГО ОСУЖДЕНО","Лишение свободы: всего","Условное осуждение к лишению свободы","Штраф", "Определено лечение: от алкоголизма, наркомании, токсикомании, у психиатора", "amnesty")]
names(d2014)[names(d2014) == "Определено лечение: от алкоголизма, наркомании, токсикомании, у психиатора"] <- "Определено лечение: всего"
d2014$year <- 2014
d2014$articles <- "228-234"
#2015
d <- read_excel("data/2015.xls", sheet = 2, skip = 0)
cols <- paste(d[5,],d[6,],d[7,],d[8,])
cols <- trimws(gsub("NA"," ",cols))
colnames(d) <- cols
d <- d[-c(1:9),]
d2015 <- d[which(d$`Статьи УК РФ` == "228-234.1"),]
d2015$amnesty <- sum(as.numeric(d2015[,28:31]))
d2015 <- d2015[,c("ВСЕГО ОСУЖДЕНО","Лишение свободы: всего","Условное осуждение к лишению свободы","Штраф (основное наказание)", "Определено лечение: от алкоголизма, наркомании, токсикомании, уврача-психиатора", "amnesty")]
names(d2015)[names(d2015) == 'Штраф (основное наказание)'] <- 'Штраф'
names(d2015)[names(d2015) == "Определено лечение: от алкоголизма, наркомании, токсикомании, уврача-психиатора"] <- "Определено лечение: всего"
d2015$year <- 2015
d2015$articles <- "228-234.1"
#2016
d <- read_excel("data/2016.xls", sheet = 2, skip = 0)
cols <- paste(d[5,],d[6,],d[7,],d[8,])
cols <- trimws(gsub("NA"," ",cols))
colnames(d) <- cols
d <- d[-c(1:9),]
d2016 <- d[which(d$`Статьи УК РФ` == "228-234.1"),]
d2016$amnesty <- sum(as.numeric(d2016[,29:32]))
d2016 <- d2016[,c("ВСЕГО ОСУЖДЕНО","Лишение свободы: всего","Условное осуждение к лишению свободы","Штраф (основное наказание)", "amnesty")]
names(d2016)[names(d2016) == 'Штраф (основное наказание)'] <- 'Штраф'
# Compulsory treatment from http://www.cdep.ru/userimages/sudebnaya_statistika/2016/f6-mv-non_svod-2016.xls
d2016$"Определено лечение: всего" <- '3507'
d2016$year <- 2016
d2016$articles <- "228-234.1"

d<-do.call("rbind", list(d2009, d2010, d2011, d2012,
                         d2013, d2014, d2015, d2016))
colnames(d) <- c("all_outcomes", "imprisonment", "probation", "fine", "compulsory_treatment", "amnesty", "year", "articles")
d[,1:5] <- sapply(d[,1:5], as.numeric)
d$other_outcomes <- d$all_outcomes - ( d$imprisonment + d$probation + d$fine + d$amnesty)


write.csv2(d, "data/drug_court_decision_stats_2009-2016.csv", row.names = F)
